<template>
  <div class="container">
    <div class="text__wrapper">
        <div class="header__image">
        <svg xmlns="http://www.w3.org/2000/svg" width="190" height="32" viewBox="0 0 190 32" fill="none">
          <path d="M40.3589 9.62695H50.4601L52.4902 11.672V15.2135L51.079 16.286L52.9854 17.8073V21.5483L50.9552 23.5934H40.3589V9.62695ZM43.206 15.3632H49.6678V11.9713H43.206V15.3632ZM43.206 21.2491H50.1135V17.6078H43.206V21.2491Z" fill="#181D27"/>
          <path d="M55.4699 23.5934V9.62695H58.3418V15.0888H62.3773L65.7691 9.62695H69.0372L64.8778 16.0615L69.2352 23.5934H65.9919L62.6496 17.5829H58.3418V23.5934H55.4699Z" fill="#181D27"/>
          <path d="M70.8226 9.62695H80.9238L82.954 11.672V15.2135L81.5428 16.286L83.4491 17.8073V21.5483L81.419 23.5934H70.8226V9.62695ZM73.6698 15.3632H80.1316V11.9713H73.6698V15.3632ZM73.6698 21.2491H80.5772V17.6078H73.6698V21.2491Z" fill="#181D27"/>
          <path d="M85.686 21.0994V15.6126L95.1435 15.3632V12.121H86.1812V9.62695H95.5396L98.0154 12.121V23.5934H88.1618L85.686 21.0994ZM88.5579 17.7076V21.1493H95.1435V17.2088L88.5579 17.7076Z" fill="#181D27"/>
          <path d="M100.779 27.0851V9.62695H110.979L113.504 12.1708V21.0495L110.979 23.5934H103.651V27.0851H100.779ZM110.632 12.121H103.651V21.0994H110.632V12.121Z" fill="#181D27"/>
          <path d="M123.113 23.5934H120.241V12.1708H115.24V9.62695H128.114V12.1708H123.113V23.5934Z" fill="#181D27"/>
          <path d="M143.354 23.5934H140.507V12.8941L133.303 23.5934H129.985V9.62695H132.832V20.3762L140.037 9.62695H143.354V23.5934Z" fill="#181D27"/>
          <path d="M146.136 27.0851V9.62695H156.336L158.861 12.1708V21.0495L156.336 23.5934H149.008V27.0851H146.136ZM155.989 12.121H149.008V21.0994H155.989V12.121Z" fill="#181D27"/>
          <path d="M161.241 21.0994V15.6126L170.698 15.3632V12.121H161.736V9.62695H171.095L173.57 12.121V23.5934H163.717L161.241 21.0994ZM164.113 17.7076V21.1493H170.698V17.2088L164.113 17.7076Z" fill="#181D27"/>
          <path d="M175.492 23.5934L179.255 16.1613L175.814 9.62695H179.032L181.706 15.1637H183.786L186.459 9.62695H189.678L186.237 16.1613L190 23.5934H186.781L184.008 17.6577H181.483L178.71 23.5934H175.492Z" fill="#181D27"/>
          <path d="M0.308716 7.24528C0.308716 3.24382 3.55254 0 7.554 0H25.0634C29.0649 0 32.3087 3.24382 32.3087 7.24528V24.7547C32.3087 28.7562 29.0649 32 25.0634 32H7.554C3.55254 32 0.308716 28.7562 0.308716 24.7547V7.24528Z" fill="#181D27"/>
          <mask id="mask0_0_84" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="33" height="32">
            <path d="M0.308716 7.24528C0.308716 3.24382 3.55254 0 7.554 0H25.0634C29.0649 0 32.3087 3.24382 32.3087 7.24528V24.7547C32.3087 28.7562 29.0649 32 25.0634 32H7.554C3.55254 32 0.308716 28.7562 0.308716 24.7547V7.24528Z" fill="black"/>
          </mask>
          <g mask="url(#mask0_0_84)">
            <path d="M33.4811 12.0278C28.5774 10.4856 23.6711 9.49416 18.7647 9.05352C13.8584 8.61288 8.99738 8.75976 4.11504 9.45744C1.34153 9.86135 -1.43465 10.4122 -4.20816 11.1465L-4.58455 3.619C1.74728 5.12451 8.07643 6.99721 14.4056 9.23712C20.7347 11.477 27.0639 14.0841 33.393 17.0951C36.946 18.7843 40.4963 20.5468 44.0493 22.4562C44.2575 22.5664 44.5698 23.3008 44.6873 26.0915C44.7967 28.6986 44.5939 30.0572 44.4257 29.9838C37.8296 27.6704 31.2282 27.4501 24.6294 29.3595C18.0306 31.269 11.4372 35.3449 4.8518 41.5138C1.152 44.9654 -2.54512 49.1148 -6.23691 53.9251C-6.43711 54.1821 -6.76812 52.8235 -6.87489 50.2898C-6.99235 47.5358 -6.77345 46.5811 -6.61329 46.3975C-0.0438881 37.8418 6.54153 31.3791 13.1323 27.0462C19.723 22.7133 26.3245 20.5468 32.9232 20.5101C36.631 20.5101 40.3388 21.1343 44.0466 22.4562L44.423 29.9838C38.0965 26.5688 31.7674 23.5578 25.4382 20.8773C19.1091 18.2335 12.7799 15.9201 6.45076 14.0107C2.89779 12.9458 -0.657852 11.9544 -4.21083 11.1098C-4.41904 11.0731 -4.73403 10.2286 -4.84881 7.47457C-4.9636 4.72059 -4.75272 3.619 -4.58721 3.58228C0.321819 2.3338 5.22551 1.56269 10.1319 1.37909C15.0382 1.19549 19.8992 1.52597 24.7816 2.44396C27.5551 2.95804 30.3312 3.65572 33.1048 4.53699C33.313 4.61043 33.628 5.41826 33.7427 8.17225C33.8522 10.7793 33.6493 12.138 33.4811 12.0645V12.0278Z" fill="#D0D0D0" fill-opacity="0.2"/>
            <path d="M7.15125 24.8079L11.9318 15.3549L7.56011 7.04395H11.6487L15.0454 14.0861L21.0839 7.04395H25.1725L20.8008 15.3549L25.5813 24.8079H21.4927L17.9703 17.2582L11.2398 24.8079H7.15125Z" fill="white" fill-opacity="0.95"/>
          </g>
        </svg>
      </div>

      <div class="header__text">
        <h2>Ремонт без паники. Интерьер без переделок.</h2>
        <h6>Один клик — и ты видишь, как может выглядеть твоя квартира. И сколько это стоит.</h6>
      </div>
    </div>

    <div class="legend__wrapper">
        <p class="text_xl_regular">Мы запускаем платформу, где дизайн интерьера — это не эскизы в теории, а конкретные готовые решения для твоей квартиры. Под твою планировку, стиль жизни и бюджет. Без абстракций и «примерно как на картинке». Всё чётко: как будет выглядеть, сколько стоит, где купить, как расставить.</p>
        <div class="filler"></div>
    </div>

    <img class="vector" src="../../assets/b2c2/Vector2.png">
    <img class="IsometricRoom" src="../../assets/b2c2/IsometricRoom.png">
    <img class="IsometricRoomMobile" src="../../assets/b2c2/IsometricRoomMobile.png">
  </div>
</template>

<script>
export default {
  name: "B2C2MainComp"
};
</script>

<style scoped>

.IsometricRoomMobile {
  display: none;
}

.IsometricRoom {
    position: absolute;
    bottom: 0;
    right: 0;;
    z-index: 3;
    border-radius: 0px 0px 0px 56px;
}

.vector {
    position: absolute;
    height: 90%;
    bottom:0;
    left:0;
    z-index: 1;
}

.text__wrapper {
    z-index: 2;
    display: flex;
    flex-direction: column;
    gap: 24px;
    max-width: 100%;
    box-sizing: border-box;
}

.header__text {
    z-index: 2;
    max-width: 100%;
    box-sizing: border-box;
}

.header__text h2 {
    max-width: 100%;
}

.legend__wrapper {
    z-index: 2;
    display: flex;
    flex-wrap: nowrap;
}

.text_xl_regular {
    width: 40%;
    box-sizing: border-box;
}

.filler {
    width: 40%;
    box-sizing: border-box;
}

.container {
    position: relative;
    max-width: 100vw;
    height: 100vh;
    padding: 40px;
    display: flex;
    flex-direction: column;
    justify-content: space-between;
    align-items: flex-start;
    box-sizing: border-box;
    background-color: #FFF;
    border-radius: 0px 0px 56px 56px;
}


@media screen and (max-width: 1440px) {
  .vector {
    max-width: 100%;
  }

  .IsometricRoom {
    width: 60%;
  }
}

@media screen and (max-width: 915px) {
  .vector {
    display: none;
  }

  .IsometricRoom {
    display: none;
  }

  .IsometricRoomMobile {
    display: block;
  }

  .container {
    height: fit-content;
    gap: 16px;
  }

  .container {
    padding: 16px;
  }

  .header__text h6 {
    font-size: 18px;
    font-weight: 400;
  }

  .filler {
    display: none;
  }

  .text_xl_regular {
    max-width: 100%;
    width: 100%;
  }
}
</style>
